# Specifications - Database
Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

The goal is to create five dataframes listed below and import them to a SQL database.

**1. Title Basics**
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

**2. Title Ratings**
- Movie ID (tconst)
- Average Movie Rating
- Number of Votes

**3. The TMDB API Results (multiple files)**
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)


**4. Title genres**

**5. Genres**


After that:
- Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [18]:
#imports
import json
import pandas as pd
import numpy as np
import os
import pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *

# Normalize and create genre table from Basics df

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

## Getting a list of Unique Values

In [3]:
#create a new col with list of genres
basics['genres_split']=basics['genres'].str.split(',')

#separate genres_split to different rows
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",History

In [4]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
print(type(unique_genres))
unique_genres

<class 'list'>

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

# Create title_genres dataframe

In [5]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

# Create genres dataframe

In [6]:
## Making the genre mapper dictionary
## making a dict to assign each genre (key) with a value
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace the string genres in title_genres with the new integer ids

In [7]:
title_genres['genre_id']=title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

#  Convert the genre map dictionary into a dataframe

In [8]:
## Manually make df with name col from the key and value
genres=pd.DataFrame({'Genre_Name': genre_map.keys(),
                                                  'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Create title basics table

In [13]:
keepers = ['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']
title_basics = basics[keepers]
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0043139,Life of a Beijing Policeman,2013,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

# Create title ratings table

In [10]:
tmdb_ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1976
1  tt0000002            5.8       264
2  tt0000005            6.2      2617
3  tt0000006            5.1       182
4  tt0000007            5.4       820

# Create tmdb data table

In [12]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
keepers = ['imdb_id','budget', 'revenue', 'certification' ]
tmdb_data = tmdb_data[keepers]
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0118694    150000.0  14204632.0            PG
2  tt0119273  15000000.0         0.0             R
3  tt0120263         0.0     80334.0           NaN
4  tt0120467    120000.0     14904.0             R

# Saving the mySQL tables w/ tconst as the primary key

## Create database engine

In [14]:
#create connection string
username='root'
password='Hjtsai$$1031'
db_name='IMDB Data'
connection=f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
    
#create an engine
engine=create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/IMDB Data)

In [15]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print("The database created!")

It exists!

## Saving title basics table

In [17]:
## get max string length
max_str_len = title_basics['tconst'].fillna('').map(len).max()

## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

#save to sql with dtype and ic
title_basics.to_sql('title_basics', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Saving title ratings table

In [20]:
## get max string length
#max_str_len = title_basics['tconst'].fillna('').map(len).max()

## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float()}

#save to sql with dtype and ic
title_basics.to_sql('title_ratings', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Saving title genre table

## Saving genre table

## Saving tmdb table

## Display first 5 rows of that table using a SQL query